Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotKeepWallJoinToRoof Property
 Can't keep wall and [target] joined
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepWallJoinToRoof { get; }
Public Shared ReadOnly Property CannotKeepWallJoinToRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepWallJoinToRoof {
	FailureDefinitionId^ get ();
}
static member CannotKeepWallJoinToRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace